%Вызов функции
%{
многострочный комментарий
%}
v = fact(5);
disp(['Result: ' num2str(v)]);

%Матрицы
a = [1 2 3]; % строка
disp(['a: ' num2str(a)]);

a1 = [4; 5; 6]; % столбец
disp('a1: ');
disp(a1);

a2 = [1 2 3; 4 5 6];% 2х3
disp('a2:');
disp(a2);

a3 = 5:-2:0; % вектор с 5 до 0 с шагом -2
disp(['a3: ' num2str(a3)]);

a4 = 1:5; % вектор значений от 1 до 5]
disp(['a4: ' num2str(a4)]);

a5 = zeros(2,3); %матрица 0 2х3
disp('a5:');
disp(a5);

a6 = ones(2); %матрица 1 2х2 
disp('a6:');
disp(a6);

% операции с матрицами
a = [1 2; 3 4];
b = [5, 6];
c = [7;8;9];

r = [a;b];%объединяем a и b 
disp('r:');
disp(r);

r = [r c];%добавляем к r столбец с
disp('new r:');
disp(r);

a = [1 2 3; 4 5 6];
disp('a:');
disp(a);

a(:, 2)=[] % удаление 2-го слолбца
disp('a:');
disp(a);

a(1, :)=[] % удаление 1-ой строки
disp('a:');
disp(a);

a = [1 2 3 4; 5 6 7 8; 9 10 11 12];
disp('a:');
disp(a);

row2 = a(2, :)%получение 2-ой строки из матрицы а
col3 = a(:,3)%получение 3-ей колонки из матрицы
disp(['row2:' num2str(row2)]);
disp('col3:');
disp(col3);

part = a([1 3], [2 4])%получение элементов из 1-й, 3-й, 2-й 4-й колонок
disp('part:')
disp(part)

a = [1 2 3]
b = a' %транспонирование
disp(a)
disp(b)

a = [1 2 3]
b = [4 5 6]

c = a + b  % + и -
d = a - b

a = [1 2; 3 4]
b = [5 6; 7 8]

m = a*b %* / ^
d = a/b
p = a^2

a = [1 2; 3 4]
b = [5 6; 7 8]

m = a.*b%поэлементные операции
d = a./b
p = a.^2

%строки
str = 'результат:'
a = [1 2 3];
b = [4 5 6];
disp(['результат: ' num2str(a + b)])

%вывод информации в графическом виде
x = [1 2 3];
y = [4 5 6];

%plot(x, y);
%hold on - объединение графиков (наложение)hold off - выключить
%figure % 2 окошка
%plot(x, y, 'r*--');

x1 = [1 2 3];
y1 = [4 5 6];

x2 = [2 4 6];
y2 = [7 8 9];

%построение обеих кривых
plot(x1, y1, 'r*--', x2, y2, 'g');
% clc - очистить командную строку
% clear all - очистить память всех переменных
% close all -закрыть все графические окна
% можно писать help plot в коммандную строку

















 








 








